# CwpReuseExistingLevels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpReuseExistingLevels Property
ParameterTypeId Class See Also
---
"Reuse matching Levels"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpReuseExistingLevels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpReuseExistingLevels As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpReuseExistingLevels {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace